ХМНПФ_Общее/Documents/уп_ИзменениеРазмеровПенсионныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ИзменениеРазмеровПенсионныхВыплат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзменятьПериодичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УчестьРазницуВПрошлыхНачислениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_УстановитьСрезСчетчикаНачисленийНПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_УстановитьСостоянияПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_УстановитьПервуюВыплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтарыйРазмер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВыделяемаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ОснованиеНазначенияПенсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ПродолжительностьВыплатыПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_Категория</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ФормаВыплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ПенсионнаяСхема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ВидВедомости</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>110</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_СрокВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_БанковскиеРеквизиты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>хм_Каспер_ПериодичностьВыплат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_РазмерПенсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РазмерПенсии</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ИзменениеРазмеровПенсионныхВыплат/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 8 до 27 // №459
	// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
КонецПроцедуры

// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
	ЭтотОбъект.Записать(?(ПРОВЕДЕН,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения));
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=Дата Тогда
		ВестиУчетПоСхемам = Истина;
	Иначе
		ВестиУчетПоСхемам = Ложь;
	КонецЕсли;	
	//// это если по оборотам
	////определим конец периода последнего сделанного начисления
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	НачисленияПенсийОбороты.НомерСчета,
	//			   |	МАКСИМУМ(НачисленияПенсийОбороты.КонПериода) КАК КонПериода,
	//			   |	СУММА(НачисленияПенсийОбороты.СуммаПриход) КАК СуммаПриход,
	//			   |	МАКСИМУМ(СостоянияПССрезПоследних.Период) КАК Период
	//			   |ИЗ
	//			   |	РегистрНакопления.уп_НачисленияПенсий.Обороты(
	//			   |		,
	//			   |		&Дата,
	//			   |		Период,
	//			   |		НомерСчета В (&СписокСчетов)
	//			   |			И КонПериода > &ДатаИзменения) КАК НачисленияПенсийОбороты
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
	//			   |		&ДатаИзменения,
	//			   |		НомерСчета В (&СписокСчетов)
	//			   |		    И Состояние = &Состояние) КАК СостоянияПССрезПоследних
	//			   |		ПО НачисленияПенсийОбороты.НомерСчета = СостоянияПССрезПоследних.НомерСчета
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	НачисленияПенсийОбороты.НомерСчета";
	//
	//Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов.ВыгрузитьКолонку("НомерСчета"));
	//Запрос.УстановитьПараметр("ДатаИзменения", ДатаИзменения);
	//Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	//Запрос.УстановитьПараметр("Состояние", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
	//
	//ТЗНачислений = Новый ТаблицаЗначений;
	//ТЗНачислений.Колонки.Добавить("НомерСчета");
	//ТЗНачислений.Колонки.Добавить("ДатаКонцаПериода", Новый ОписаниеТипов("Дата"));
	//ТЗНачислений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	//ТЗНачислений.Колонки.Добавить("ДатаНачалаВыплат", Новый ОписаниеТипов("Дата"));
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка.Следующий() Цикл
	//	стр = ТЗНачислений.Добавить();
	//	стр.НомерСчета = Выборка.НомерСчета;
	//	стр.ДатаКонцаПериода = Выборка.КонПериода;
	//	стр.Сумма = Выборка.СуммаПриход;
	//	стр.ДатаНачалаВыплат = Выборка.Период;
	//КонецЦикла;

	// а если по данным регистра сведений, тогда так

#Вставка
	Если КонецДня(Дата)>КонецДня(ДатаИзменения) И УчестьРазницуВПрошлыхНачислениях Тогда
#КонецВставки
#Удаление
	Если КонецДня(Дата)>КонецДня(ДатаИзменения) Тогда
#КонецУдаления
		//определим даты начала выплат 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СостоянияПССрезПоследних.Период КАК ДатаНачалаВыплат,
		|	СостоянияПССрезПоследних.НомерСчета
		|ИЗ
		|	РегистрСведений.уп_СостоянияПС.СрезПоследних(
		|		&ДатаИзменения,
		|		НомерСчета В (&СписокСчетов)
		|		    И Состояние = &Состояние) КАК СостоянияПССрезПоследних";

		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов.ВыгрузитьКолонку("НомерСчета"));
		Запрос.УстановитьПараметр("ДатаИзменения", ДатаИзменения);
		Запрос.УстановитьПараметр("Состояние", Перечисления.уп_СостоянияПС.ВыплатнойПериод);

		ТЗНачислений = Запрос.Выполнить().Выгрузить();
		ТЗНачислений.Колонки.Добавить("ДатаКонцаПериода", Новый ОписаниеТипов("Дата"));
		ТЗНачислений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
#Вставка
 		ТЗРасчетаДоначисления = ТЗНачислений.Скопировать();
		ТЗРасчетаДоначисления.Очистить();
		ТЗРасчетаДоначисления.Колонки.Добавить("РазмерДоИзменения", Новый ОписаниеТипов("Число"));
		ТЗРасчетаДоначисления.Колонки.Добавить("РазмерПослеИзменения", Новый ОписаниеТипов("Число"));
		ТЗРасчетаДоначисления.Колонки.Добавить("Разница", Новый ОписаниеТипов("Число"));
#КонецВставки

		//рассчитать сколько надо было заплатить от даты изменения до даты документа
		Для каждого стр из ТЗНачислений Цикл
			Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаИзменения-1,Новый Структура("НомерСчета",стр.НомерСчета)).ПериодичностьВыплат;
			ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаИзменения, Периодичность);
			ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаИзменения, Периодичность);
			СуммаВРегистре = РегистрыСведений.уп_РазмерПенсии.ПолучитьПоследнее(ДатаКонцаПериода,Новый Структура("НомерСчета",стр.НомерСчета)).Размер;
#Вставка
			СостояниеНаДату = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",стр.НомерСчета)).Состояние;
			Если Не СостояниеНаДату = Перечисления.уп_СостоянияПС.ВыплатнойПериод
				И Не СостояниеНаДату = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены Тогда
            	СуммаВРегистре = 0;
			КонецЕсли;
	 		стрРасчета = ТЗРасчетаДоначисления.Добавить();
			стрРасчета.ДатаНачалаВыплат = ДатаНачалаПериода;
			стрРасчета.ДатаКонцаПериода = ДатаКонцаПериода;
			стрРасчета.НомерСчета = стр.НомерСчета;
			стрРасчета.РазмерДоИзменения = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);			
			стрРасчета.Разница =  -1 * ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);			
#КонецВставки
			СуммаЕсть = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);
			Пока (ДатаКонцаПериода+1)<НачалоДня(Дата) Цикл
				ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода((ДатаКонцаПериода+1), Периодичность);
				Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",стр.НомерСчета)).ПериодичностьВыплат;
				ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаНачалаПериода, Периодичность);
				СуммаВРегистре = РегистрыСведений.уп_РазмерПенсии.ПолучитьПоследнее(ДатаКонцаПериода,Новый Структура("НомерСчета",стр.НомерСчета)).Размер;
#Вставка
				СостояниеНаДату = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",стр.НомерСчета)).Состояние;
				Если Не СостояниеНаДату = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					И Не СостояниеНаДату = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены Тогда
	            	СуммаВРегистре = 0;
				КонецЕсли;
		 		стрРасчета = ТЗРасчетаДоначисления.Добавить();
				стрРасчета.ДатаНачалаВыплат = ДатаНачалаПериода;
				стрРасчета.ДатаКонцаПериода = ДатаКонцаПериода;
				стрРасчета.НомерСчета = стр.НомерСчета;
				стрРасчета.РазмерДоИзменения = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);			
				стрРасчета.Разница = -1 * ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);			
#КонецВставки
				СуммаЕсть = СуммаЕсть+ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,СуммаВРегистре);
			КонецЦикла;
			стр.ДатаКонцаПериода = ДатаКонцаПериода;
			стр.Сумма = СуммаЕсть;
		КонецЦикла;	
	КонецЕсли;

	Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл
#Вставка
		Если КонецДня(Дата)>КонецДня(ДатаИзменения) И УчестьРазницуВПрошлыхНачислениях Тогда
#КонецВставки
#Удаление
		Если КонецДня(Дата)>КонецДня(ДатаИзменения) Тогда
#КонецУдаления
			Стр = ТЗНачислений.Найти(ТекСтрокаСписокСчетов.НомерСчета,"НомерСчета");
		Иначе
			Стр = Неопределено;
		КонецЕсли;

#Вставка
//https://redmine.npf.com/issues/4261
		Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
			Если Не БылоИзменениеПериодичностиВЭтомПериоде(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат,ТекСтрокаСписокСчетов.НомерСчета,ЭтотОбъект.Ссылка, ДатаИзменения) Тогда
				Движение = Движения.уп_ПериодичностьВыплат.Добавить();
				Движение.Период = ДатаИзменения;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.ПериодичностьВыплат = ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат;
				Движение.НомерМесяцаВПериоде = уп_НПОСервер.ОпределитьНомерМесяцаВПериоде(Движение.ПериодичностьВыплат, ДатаИзменения);
			КонецЕсли;
		ИначеЕсли ИзменятьПериодичность Тогда
#КонецВставки
#Удаление
		Если ИзменятьПериодичность Тогда
#КонецУдаления
			Движение = Движения.уп_ПериодичностьВыплат.Добавить();
			Движение.Период = ДатаИзменения;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.ПериодичностьВыплат = ПериодичностьВыплат;
		КонецЕсли;

		Если Стр = Неопределено Тогда //значит начислений не было
#Вставка
			//https://redmine.npf.com/issues/4703
			Если Не хм_УстановитьПервуюВыплату(ДатаИзменения,ТекСтрокаСписокСчетов) Тогда
#КонецВставки
			// регистр РазмерПенсии 
			Движение = Движения.уп_РазмерПенсии.Добавить();
			Движение.Период = ДатаИзменения;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.Размер = ТекСтрокаСписокСчетов.Сумма;
#Вставка
			//https://redmine.npf.com/issues/4703
			КонецЕсли;
#КонецВставки
		Иначе  //начисления были
			СуммаНачисленная = Стр.Сумма;
			ДатаОкончанияНачислений = Стр.ДатаКонцаПериода;
			//определим те начисления, которые были бы сделаны с новым размером до даты конца периода
			//1 - определим периодичность на дату изменения размера
			Если ИзменятьПериодичность Тогда
				Периодичность = ПериодичностьВыплат;
#Вставка
//https://redmine.npf.com/issues/4261
				Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
					Периодичность = ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
				Периодичность = ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат;
#КонецВставки
			Иначе
				Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаИзменения,Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета)).ПериодичностьВыплат;
			КонецЕсли;
			ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаИзменения, Периодичность);
			ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаИзменения, Периодичность);
			СуммаДолжнаБыть = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);
#Вставка
		 		стрРасчета = ТЗРасчетаДоначисления.Добавить();
				стрРасчета.ДатаНачалаВыплат = ДатаНачалаПериода;
				стрРасчета.ДатаКонцаПериода = ДатаКонцаПериода;
				стрРасчета.НомерСчета = стр.НомерСчета;
				стрРасчета.РазмерПослеИзменения = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);			
				стрРасчета.Разница = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);			
#КонецВставки
			Пока ДатаКонцаПериода<ДатаОкончанияНачислений Цикл
				ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
				Если ИзменятьПериодичность Тогда
					Периодичность = ПериодичностьВыплат;
#Вставка
//https://redmine.npf.com/issues/4261
					Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
						Периодичность = ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
					Периодичность = ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат;
#КонецВставки
				Иначе
					Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета)).ПериодичностьВыплат;
				КонецЕсли;
				ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаНачалаПериода, Периодичность);
				СуммаДолжнаБыть = СуммаДолжнаБыть+ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);
#Вставка
		 		стрРасчета = ТЗРасчетаДоначисления.Добавить();
				стрРасчета.ДатаНачалаВыплат = ДатаНачалаПериода;
				стрРасчета.ДатаКонцаПериода = ДатаКонцаПериода;
				стрРасчета.НомерСчета = стр.НомерСчета;
				стрРасчета.РазмерПослеИзменения = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);			
				стрРасчета.Разница = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);			
#КонецВставки
			КонецЦикла;	
			//теперь сравним
#Вставка
			//https://redmine.npf.com/issues/4703
			Если Не хм_УстановитьПервуюВыплату(ДатаНачалаПериода,ТекСтрокаСписокСчетов) Тогда
				ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ДатаНачалаПериода;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Размер = ТекСтрокаСписокСчетов.Сумма;
			КонецЕсли;
#КонецВставки

#Удаление
			Разница = СуммаДолжнаБыть-СуммаНачисленная;
			Если Разница>0 Тогда
				//на следующий период сумма должна быть добавлена к основной
				ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
				Если ИзменятьПериодичность Тогда
					Периодичность = ПериодичностьВыплат;
				Иначе
					Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета)).ПериодичностьВыплат;
				КонецЕсли;
				ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаНачалаПериода, Периодичность);
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ДатаНачалаПериода;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Размер = ТекСтрокаСписокСчетов.Сумма+Разница;

				//теперь стандартно
				ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ДатаНачалаПериода;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Размер = ТекСтрокаСписокСчетов.Сумма;
			Иначе
				//обнуляем следующие периоды
				Пока Разница<0 Цикл
					ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
					Если ИзменятьПериодичность Тогда
						Периодичность = периодичностьВыплат;
					Иначе
						Периодичность = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДатаНачалаПериода,Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета)).ПериодичностьВыплат;
					КонецЕсли;
					ДатаКонцаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаНачалаПериода, Периодичность);
					СуммаДолжнаБытьЗаПериод = ОпределитьСумму(ДатаНачалаПериода,стр.ДатаНачалаВыплат,Периодичность,ТекСтрокаСписокСчетов.Сумма);
					Разница = Разница+СуммаДолжнаБытьЗаПериод;
					СуммаВРегистр = ?(Разница<0,0,Разница);

					Движение = Движения.уп_РазмерПенсии.Добавить();
					Движение.Период = ДатаНачалаПериода;
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					Движение.Размер = СуммаВРегистр;
				КонецЦикла;	
				//теперь стандартно
				ДатаНачалаПериода = КонецДня(ДатаКонцаПериода)+1;
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ДатаНачалаПериода;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Размер = ТекСтрокаСписокСчетов.Сумма;
			КонецЕсли;	
#КонецУдаления
		КонецЕсли;
	КонецЦикла;
	
#Вставка
	Если КонецДня(Дата)>КонецДня(ДатаИзменения) И УчестьРазницуВПрошлыхНачислениях Тогда
		ТЗРасчетаДоначисления.Свернуть("НомерСчета,ДатаНачалаВыплат,ДатаКонцаПериода","Разница, РазмерДоИзменения, РазмерПослеИзменения");
		ЕстьМинусоваяРазница = Ложь;
		лСообщениеОбОшибке = Новый СообщениеПользователю();
		Для каждого стрРасчета Из ТЗРасчетаДоначисления Цикл
			Если стрРасчета.Разница < 0 Тогда
	        	ЕстьМинусоваяРазница = Истина;
				лСообщениеОбОшибке.Текст = лСообщениеОбОшибке.Текст + Символы.ПС+ " Минусовая разница " + стрРасчета.Разница + " за период " + стрРасчета.ДатаНачалаВыплат;
				Прервать;
			ИначеЕсли стрРасчета.Разница > 0 Тогда
				Движение = Движения.уп_ЗадолженностьПоПенсиям.ДобавитьПриход();
				Движение.НомерСчета = стрРасчета.НомерСчета;
				Движение.Период = Дата;
				Движение.НачалоПериода = стрРасчета.ДатаНачалаВыплат;
				Движение.КонецПериода = стрРасчета.ДатаКонцаПериода;
				Движение.Счетчик = 0;
				Движение.СуммаПенсии = стрРасчета.Разница;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьМинусоваяРазница = Истина Тогда
			Отказ = Истина;
			лСообщениеОбОшибке.Текст = "По документу "+ лСообщениеОбОшибке.КлючДанных + " необходимо выполнить ручное удержание пенсии, для возможности проведения необходимо отключить учет разниц в прошлых периодах" + Символы.ПС + лСообщениеОбОшибке.Текст ;
			лСообщениеОбОшибке.КлючДанных = ЭтотОбъект.Ссылка;
			лСообщениеОбОшибке.ПутьКДанным = "Объект";;
			лСообщениеОбОшибке.Поле = "УчестьРазницуВПрошлыхНачислениях";	
			лСообщениеОбОшибке.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Движения.уп_ЗадолженностьПоПенсиям.Записать();
#КонецВставки
	
	//если выделяются суммы
	Если СписокСчетов.Итог("ВыделяемаяСумма")<>0 Тогда
		//если переводимая сумма меньше нуля, то надо знать остаток по счету
		ССЧ = Новый СписокЗначений;
		Для каждого стр из СписокСчетов Цикл
			Если стр.ВыделяемаяСумма<0 Тогда
				//определим сам счет надо вставить или счет договора
				Схема = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета",стр.НомерСчета)).Схема;
				ТекТипРезерва = уп_ОбщегоНазначенияУчетРезервов.ОпределитьКонечныйТипРезерва(Схема,Перечисления.уп_ТипыРезерва.СПС);
				Если (ТекТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат)  Тогда
					//и (ТекСтрокаСписокСчетов.ПенсионныйДоговор.Вкладчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо) Тогда
					ПорядокВеденияПожизненногоРезерва = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(Схема, стр.НачальнаяДата);
					Если ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.ПоДоговорам Тогда
						НомерСчетаДоговора = уп_ОбщегоНазначенияУчетРезервов.ОпределитьНомерПожизненногоСчетаДоговора(ТекСтрокаСписокСчетов.ПенсионныйДоговор, ЭтотОбъект, Истина, ТекСтрокаСписокСчетов.Схема);
						Если ССЧ.НайтиПоЗначению(НомерСчетаДоговора)= Неопределено Тогда
							ССЧ.Добавить(НомерСчетаДоговора);
						КонецЕсли;
					ИначеЕсли ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
						НомерСчетаПустой = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
						Если ССЧ.НайтиПоЗначению(НомерСчетаПустой)= Неопределено Тогда
							ССЧ.Добавить(НомерСчетаПустой);
						КонецЕсли;
					Иначе
						Если ССЧ.НайтиПоЗначению(стр.НомерСчета)= Неопределено Тогда
							ССЧ.Добавить(стр.НомерСчета);
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если ССЧ.НайтиПоЗначению(стр.НомерСчета)= Неопределено Тогда
						ССЧ.Добавить(стр.НомерСчета);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;

		СписокВозврата = Проверка(Заголовок);
		Отказ = СписокВозврата.Получить(0).Значение;
		Если Списоксчетов.Итог("ВыделяемаяСумма")<>0 Тогда
			Если Не Отказ Тогда
				ТаблицаОстатков = СписокВозврата.Получить(1).Значение;
				ДеревоОстатковПоСчетам = РассчитатьОстатки(ССЧ);
				ДвиженияПоВыделеннымСуммам(ТаблицаОстатков, ДеревоОстатковПоСчетам, Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;	

	Если ОтражатьВБухгалтерскомУчете Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
	КонецЕсли;	

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	

	// записываем движения регистров
	Движения.уп_РазмерПенсии.Записать();
	Движения.уп_ПериодичностьВыплат.Записать();
	Движения.уп_Резервы.Записать();
	Движения.Хозрасчетный.Записать();
КонецПроцедуры

//https://redmine.npf.com/issues/4703
Функция хм_УстановитьПервуюВыплату(Период,СтрокаСчета)
	
	Если хм_УстановитьПервуюВыплату Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	хм_ПерваяВыплатаНПО.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.хм_ПерваяВыплатаНПО КАК хм_ПерваяВыплатаНПО
			|ГДЕ
			|	хм_ПерваяВыплатаНПО.НомерСчета = &НомерСчета
			|	И хм_ПерваяВыплатаНПО.Регистратор <> &Регистратор";
		
		Запрос.УстановитьПараметр("НомерСчета", СтрокаСчета.НомерСчета);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			хм_ПерваяВыплатаНПО = РегистрыСведений.хм_ПерваяВыплатаНПО.СоздатьНаборЗаписей();
			хм_ПерваяВыплатаНПО.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
			хм_ПерваяВыплатаНПО.Записать();
		КонецЕсли;
			
		хм_ПерваяВыплатаНПО = Движения.хм_ПерваяВыплатаНПО;
  		нСтр = хм_ПерваяВыплатаНПО.Добавить();
		
		нСтр.НомерСчета = СтрокаСчета.НомерСчета;
		нСтр.Участник = СтрокаСчета.Участник;
		нСтр.ПенсионныйДоговор = СтрокаСчета.ПенсионныйДоговор;

		нСтр.ПериодНачисленияПервойВыплаты = Период;
		нСтр.Начислено = СтрокаСчета.Сумма;

	КонецЕсли;

	Возврат хм_УстановитьПервуюВыплату;
КонецФункции

&ИзменениеИКонтроль("ДвиженияПоВыделеннымСуммам")
Процедура ХМДвиженияПоВыделеннымСуммам(ТаблицаОстатков, ДеревоОстатковПоСчетам, Отказ)
	СуммаКРаспределению = СписокСчетов.Итог("ВыделяемаяСумма");
	ТабСписанияЗачисления = Новый ТаблицаЗначений;
	ТабСписанияЗачисления.Колонки.Добавить("ТипСуммыСп");
	ТабСписанияЗачисления.Колонки.Добавить("СуммаСп", Новый ОписаниеТипов("Число"));
	ТабСписанияЗачисления.Колонки.Добавить("ТипСуммыЗ");
	ТабСписанияЗачисления.Колонки.Добавить("СуммаЗ",Новый ОписаниеТипов("Число"));

	СхемаСтарая = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета", НомерСчета)).Схема;
	НовТаблицаОстатков = ТаблицаОстатков.Скопировать();
	Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл
		СуммаКЗачислению = ТекСтрокаСписокСчетов.ВыделяемаяСумма;
		ТекНомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
		НачТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
		Схема = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета)).Схема;
		ТекТипРезерва = уп_ОбщегоНазначенияУчетРезервов.ОпределитьКонечныйТипРезерва(Схема,НачТипРезерва);
		ВидДвижения = Перечисления.уп_ВидыДвижений.ПеремещениеВнутриРезерва;
		ТекТипСуммы = Неопределено;
		Если (ТекТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат) Тогда
			//и (ТекСтрокаСписокСчетов.ПенсионныйДоговор.Вкладчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо) Тогда
			ПорядокВеденияПожизненногоРезерва = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(Схема, Дата);
			Если ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.ПоДоговорам Тогда
				НомерСчетаДоговора = уп_ОбщегоНазначенияУчетРезервов.ОпределитьНомерПожизненногоСчетаДоговора(ТекСтрокаСписокСчетов.ПенсионныйДоговор, ЭтотОбъект, Истина, Схема);
				ТекНомерСчета = НомерСчетаДоговора;
			ИначеЕсли ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
				ТекНомерСчета = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
				ТекТипСуммы = Справочники.уп_ТипыСумм.ПустаяСсылка();
			Иначе
				ТекНомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			КонецЕсли;
		КонецЕсли;
		Если ТекТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат Тогда
			ПризнакКт = Истина;
		Иначе
			ПризнакКт = Ложь;
		КонецЕсли;	
		Если ТекСтрокаСписокСчетов.ВыделяемаяСумма>0 Тогда
			ВидДвиженияЕПС = уп_НПОСервер.ОпределитьВидДвиженияЕПСПоРезервамНПО(Перечисления.уп_ТипыРезерва.СПС, ТекТипРезерва);
			Для каждого стр из НовТаблицаОстатков Цикл
				// регистр Резервы Приход
				Движение = Движения.уп_Резервы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.НомерСчета = ТекНомерСчета;
#Вставка
//https://redmine.npf.com/issues/4239
			Движение.Период = МАКС(ДатаИзменения,Дата);
			Движение.ПенсионныйСчетИсточник = НомерСчета;
#КонецВставки
				Движение.ТипРезерва = ТекТипРезерва;
				Если ТекТипСуммы<>Неопределено Тогда
					Движение.ТипСуммы = ТекТипСуммы;
				Иначе
					Движение.ТипСуммы = стр.ТипСуммы;
				КонецЕсли;
				Движение.ДокументРегистрации = ДокументРегистрации;
				Движение.Движение = ВидДвижения;
				Движение.ВидДвиженияЕПС = ВидДвиженияЕПС;
				Движение.Схема = Схема;
				Если стр.СуммаОстаток>СуммаКЗачислению Тогда
					Движение.Сумма = СуммаКЗачислению;
					ТекСумма = СуммаКЗачислению;
					стр.СуммаОстаток = стр.СуммаОстаток-СуммаКЗачислению;
					НовСтр = ТабСписанияЗачисления.Добавить();
					НовСтр.ТипСуммыСп = стр.ТипСуммы;
					НовСтр.СуммаСп = СуммаКЗачислению;
					СуммаКЗачислению = 0;
					//Прервать;
				Иначе
					Движение.Сумма = стр.СуммаОстаток;
					ТекСумма = стр.СуммаОстаток;
					СуммаКЗачислению = СуммаКЗачислению-стр.СуммаОстаток;
					стр.СуммаОстаток = 0;
					НовСтр.ТипСуммыСп = стр.ТипСуммы;
					НовСтр.СуммаСп = стр.СуммаОстаток;
				КонецЕсли;
				Если ВестиУчетПоСхемам Тогда
					Движение.ПенсионнаяСхема = Схема;
				КонецЕсли;

				// регистр Резервы Расход
				Движение = Движения.уп_Резервы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.НомерСчета = НомерСчета;
#Вставка
//https://redmine.npf.com/issues/4239
			Движение.Период = МАКС(ДатаИзменения,Дата);
			Движение.ПенсионныйСчетИсточник = ТекСтрокаСписокСчетов.НомерСчета;
#КонецВставки
				Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.ДокументРегистрации = ДокументРегистрации;
				Движение.Движение = Перечисления.уп_ВидыДвижений.Распоряжение;
				Движение.ВидДвиженияЕПС = ВидДвиженияЕПС;
				Движение.Схема = СхемаСтарая;
				Движение.Сумма = ТекСумма;
				Если ВестиУчетПоСхемам Тогда
					Движение.ПенсионнаяСхема = СхемаСтарая;
				КонецЕсли;

				Если СуммаКЗачислению = 0 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		Иначе  //идет возврат на солидарный счет
			ИтоговаяСтрока = ДеревоОстатковПоСчетам.Строки.Найти(ТекНомерСчета, "НомерСчета");
			Если ИтоговаяСтрока<>Неопределено Тогда

				ВсегоНаСчете = ИтоговаяСтрока.СуммаОстаток;
				Если ВсегоНаСчете>=(-ТекСтрокаСписокСчетов.ВыделяемаяСумма) Тогда
					ОсталосьСписать = -ТекСтрокаСписокСчетов.ВыделяемаяСумма;
					Для Каждого стрИт из ИтоговаяСтрока.Строки Цикл
						СуммаКСписанию = Мин(стрИт.СуммаОстаток, ОсталосьСписать);

						ВидДвиженияЕПС = уп_НПОСервер.ОпределитьВидДвиженияЕПСПоРезервамНПО(СтрИт.ТипРезерва, Перечисления.уп_ТипыРезерва.СПС);

						Движение = Движения.уп_Резервы.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.НомерСчета = ТекНомерСчета;
#Вставка
//https://redmine.npf.com/issues/4239
			Движение.Период = МАКС(ДатаИзменения,Дата);
			Движение.ПенсионныйСчетИсточник = НомерСчета;
#КонецВставки
						Движение.ТипРезерва = СтрИт.ТипРезерва;
						Движение.ТипСуммы = СтрИт.ТипСуммы;
						Движение.ДокументРегистрации = ДокументРегистрации;
						Движение.Движение = ВидДвижения;
						Движение.ВидДвиженияЕПС = ВидДвиженияЕПС;
						Движение.Схема = Схема;
						Движение.Сумма = СуммаКСписанию;
						стрИт.СуммаОстаток = стрИт.СуммаОстаток-СуммаКСписанию;
						ИтоговаяСтрока.СуммаОстаток = ИтоговаяСтрока.СуммаОстаток-СуммаКСписанию;
						НовСтр = ТабСписанияЗачисления.Добавить();
						НовСтр.ТипСуммыЗ = СтрИт.ТипСуммы;
						НовСтр.СуммаЗ = СуммаКСписанию;
						ОсталосьСписать = ОсталосьСписать-СуммакСписанию;
						Если ВестиУчетПоСхемам Тогда
							Движение.ПенсионнаяСхема = Схема;
						КонецЕсли;

						// регистр Резервы Расход
						Движение = Движения.уп_Резервы.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.НомерСчета = НомерСчета;
#Вставка
//https://redmine.npf.com/issues/4239
			Движение.ПенсионныйСчетИсточник = ТекНомерСчета;
			Движение.Период = МАКС(ДатаИзменения,Дата);
#КонецВставки
						Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
						Движение.ТипСуммы = СтрИт.ТипСуммы;
						Движение.ДокументРегистрации = ДокументРегистрации;
						Движение.Движение = Перечисления.уп_ВидыДвижений.Распоряжение;
						Движение.ВидДвиженияЕПС = ВидДвиженияЕПС;
						Движение.Схема = СхемаСтарая;
						Движение.Сумма = СуммаКСписанию;
						Если ВестиУчетПоСхемам Тогда
							Движение.ПенсионнаяСхема = СхемаСтарая;
						КонецЕсли;

						Если ОсталосьСписать = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					//недостаточно средств на счете
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Недостаточно средств на счете "+ТекНомерСчета);
					Отказ = Истина;
				КонецЕсли;
			Иначе
				//нет средств на счете для возврата
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Нет средств на счете "+ТекНомерСчета);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;

		Если ОтражатьВБухгалтерскомУчете Тогда
			уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, НомерСчета.Владелец.Вкладчик, НомерСчета.Владелец.ДоговорКонтрагента,
			СхемаСтарая, Ложь, ТекНомерСчета.Владелец.Вкладчик, ТекНомерСчета.Владелец.ДоговорКонтрагента, Схема, ПризнакКт, ТекСтрокаСписокСчетов.ВыделяемаяСумма);
		КонецЕсли;
	КонецЦикла;

	//списание - зачисление на солидарный счет
	ТабСписанияЗачисления.Свернуть("ТипСуммыСп,ТипСуммыЗ","СуммаСп,СуммаЗ");	
	//Для каждого стр из ТабСписанияЗачисления Цикл
	//	Если стр.СуммаСп>0 Тогда
	//		// регистр Резервы Расход
	//		Движение = Движения.уп_Резервы.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Организация = Организация;
	//		Движение.НомерСчета = НомерСчета;
	//		Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
	//		Движение.ТипСуммы = стр.ТипСуммыСп;
	//		Движение.ДокументРегистрации = ДокументРегистрации;
	//		Движение.Движение = Перечисления.уп_ВидыДвижений.Распоряжение;
	//		Движение.Сумма = стр.СуммаСп;
	//	КонецЕсли;
	//	Если стр.СуммаЗ>0 Тогда
	//		// регистр Резервы Расход
	//		Движение = Движения.уп_Резервы.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.Организация = Организация;
	//		Движение.НомерСчета = НомерСчета;
	//		Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
	//		Движение.ТипСуммы = стр.ТипСуммыЗ;
	//		Движение.ДокументРегистрации = ДокументРегистрации;
	//		Движение.Движение = Перечисления.уп_ВидыДвижений.Распоряжение;
	//		Движение.Сумма = стр.СуммаЗ;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры


&ИзменениеИКонтроль("Проверка")
Функция ХМПроверка(Заголовок)

	СписокВозврата = Новый СписокЗначений;
	Отказ = Ложь;

	СуммаКЗачислению = 0;
	СуммаКЗачислению = СписокСчетов.Итог("ВыделяемаяСумма");

	Если СуммаКЗачислению>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РезервыОстатки.ТипСуммы,
		|	ЕстьNULL(РезервыОстатки.СуммаОстаток,0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_Резервы.Остатки(
		|		&Дата,
		|		НомерСчета = &НомерСчета
		|			И ТипРезерва = &ТипРезерва
		|			И ТипСуммы В (&СписокТиповСумм)
		|			И Организация = &Организация) КАК РезервыОстатки";
#Вставка
//https://redmine.npf.com/issues/4239
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	СуммаОстаток УБЫВ";
#КонецВставки
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
		Запрос.УстановитьПараметр("ТипРезерва", Перечисления.уп_ТипыРезерва.СПС);
		Запрос.УстановитьПараметр("Организация", Организация);

		Если НЕ ЗначениеЗаполнено(ТипСуммы) Тогда
			ЗапросПоТипу = Новый Запрос;
			ЗапросПоТипу.Текст = "ВЫБРАТЬ
			|	ТипСуммы.Ссылка
			|ИЗ
			|	Справочник.уп_ТипыСумм КАК ТипСуммы";

			ТаблицаТиповСумм = ЗапросПоТипу.Выполнить().Выгрузить();
			СписокТиповСумм = ТаблицаТиповСумм.ВыгрузитьКолонку("Ссылка");
		Иначе
			СписокТиповСумм = Новый СписокЗначений;
			СписокТиповСумм.Добавить(ТипСуммы);
		КонецЕсли;

		Запрос.УстановитьПараметр("СписокТиповСумм", СписокТиповСумм);

		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		//Для каждого стр из ТаблицаОстатков Цикл
		//	Сообщить("Сумма "+стр.СуммаОстаток+" тип "+Стр.ТипСуммы);
		//КонецЦикла;
		Если ТаблицаОстатков.Количество()>0 Тогда
			ИтогНаСчете = ТаблицаОстатков.Итог("СуммаОстаток");
		Иначе
			ИтогНаСчете = 0;
		КонецЕсли;
		Если (ИтогНаСчете>=СуммаКЗачислению)Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
			Если ИтогНаСчете<СуммаКЗачислению  Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Сумма на счете составляет "+ИтогНаСчете+" это меньше указанной суммы к распределению.",,Заголовок);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТаблицаОстатков = Новый ТаблицаЗначений;
	КонецЕсли;
	СписокВозврата.Добавить(Отказ,"Отказ");
	СписокВозврата.Добавить(ТаблицаОстатков,"Сумма");

	Возврат СписокВозврата;
КонецФункции

Функция БылоИзменениеПериодичностиВЭтомПериоде(локПериодичностьВыплат,НомерСчета,Источник,Период) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПериодичностьВыплат.ПериодичностьВыплат КАК ПериодичностьВыплат
		|ИЗ
		|	РегистрСведений.уп_ПериодичностьВыплат КАК уп_ПериодичностьВыплат
		|ГДЕ
		|	уп_ПериодичностьВыплат.Период МЕЖДУ &НачПериод И &КонПериода
		|	И уп_ПериодичностьВыплат.НомерСчета = &НомерСчета
		|	И уп_ПериодичностьВыплат.Регистратор <> &Регистратор
		|	И уп_ПериодичностьВыплат.ПериодичностьВыплат = &ПериодичностьВыплат";
	
	Запрос.УстановитьПараметр("ПериодичностьВыплат", локПериодичностьВыплат);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Запрос.УстановитьПараметр("Регистратор", Источник);
	Запрос.УстановитьПараметр("НачПериод", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат(Истина);
	Иначе	
		Возврат(Ложь);
	КонецЕсли;
	
КонецФункции	

Функция БылоИзменениеКоличестваВыплатВЭтомПериоде(КоличествоВыплат,НомерСчета,Источник,Период) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_КоличествоНазначенныхВыплат.КоличествоВыплат КАК Количество
		|ИЗ
		|	РегистрСведений.уп_КоличествоНазначенныхВыплат КАК уп_КоличествоНазначенныхВыплат
		|ГДЕ
		|	уп_КоличествоНазначенныхВыплат.Период = &Период
		|	И уп_КоличествоНазначенныхВыплат.НомерСчета = &НомерСчета
		|	И уп_КоличествоНазначенныхВыплат.Регистратор <> &Регистратор
		|	И уп_КоличествоНазначенныхВыплат.КоличествоВыплат = &КоличествоВыплат";
	
	Запрос.УстановитьПараметр("КоличествоВыплат", КоличествоВыплат);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Запрос.УстановитьПараметр("Регистратор", Источник);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат(Истина);
	Иначе	
		Возврат(Ложь);
	КонецЕсли;
	
КонецФункции	

Функция ОпределитьКоличествоМесяцевНаВыплату(ПериодичностьВыплат) Экспорт 
	Если ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
		Возврат 12;
	ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Полугодие Тогда
		Возврат 6;
	ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
		Возврат 3;
	ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
		Возврат 1;
	Иначе 
		Возврат 1;
	КонецЕсли;
КонецФункции	

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения_После(Отказ, Режим)
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	//https://redmine.npf.com/issues/4274
 	//https://redmine.npf.com/issues/4261
	Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл
		//https://redmine.npf.com/issues/4261
		РС_ТекСостояниеПС = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета",ТекСтрокаСписокСчетов.НомерСчета));
		Если хм_УстановитьСостоянияПС Тогда
			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = Дата;
			Движение.ДатаУстановкиСостояния = ДатаИзменения;
			Движение.НомерСчета = ТекСтрокаСписоксчетов.НомерСчета;
			Движение.Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
			Движение.Основание = РС_ТекСостояниеПС.Основание;
			Движение.ДатаОкончанияОснований = РС_ТекСостояниеПС.ДатаОкончанияОснований;
		КонецЕсли;

		//https://redmine.npf.com/issues/4261
		Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ФормаВыплаты) Тогда
			Если (ТекСтрокаСписокСчетов.хм_Каспер_ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет 
					И ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_НомерЛицевогоСчета)) ИЛИ НЕ ТекСтрокаСписокСчетов.хм_Каспер_ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда 
				Движение = Движения.уп_ЛицевыеСчетаУчастников.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Участник = ТекСтрокаСписокСчетов.Участник;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.ФормаВыплаты = ТекСтрокаСписокСчетов.хм_Каспер_ФормаВыплаты;
				Если ТекСтрокаСписокСчетов.хм_Каспер_ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					Движение.ТипЛицевогоСчета = Перечисления.уп_ТипыЛицевыхСчетов.ЛицевойСчет;
				КонецЕсли;
				Движение.НомерЛицевогоСчета = ТекСтрокаСписокСчетов.хм_Каспер_НомерЛицевогоСчета;
				Движение.Банк = ТекСтрокаСписокСчетов.хм_Каспер_Получатель;
			КонецЕсли;
		КонецЕсли;
		
			
		Если хм_УстановитьСостоянияПС И ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат) Тогда
		//ОПА НПО 2018.06.14 +
		//регистр ДатыСледующихВыплат
			Движение = Движения.уп_ДатыСледующихВыплат.Добавить();
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.Период = ДатаИзменения;
			Движение.ДатаСледующейВыплаты = ДатаИзменения;
		КонецЕсли;
		
		//регистр ДатыОкончанияСрочныхВыплат
		//определяем на основании даты начала выплат
		Если хм_УстановитьСостоянияПС И ЗначениеЗаполнено(ТекСтрокаСписокСчетов.хм_Каспер_ДатаОкончанияДействия) Тогда
			Если ТекСтрокаСписокСчетов.хм_Каспер_ПродолжительностьВыплатыПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат 
				или ТекСтрокаСписокСчетов.хм_Каспер_ПенсионнаяСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат 
			Тогда
				Движение = Движения.уп_ДатыОкончанияСрочнойВыплаты.Добавить();
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Период = Дата;
				Движение.ДатаОкончанияСрочнойВыплаты = ТекСтрокаСписокСчетов.хм_Каспер_ДатаОкончанияДействия;

				//ЛыткинАМ //https://redmine.npf.com/issues/4288
				//КоличествоВыплатСОстатком = ТекСтрокаСписокСчетов.хм_Каспер_СрокВыплаты/ОпределитьКоличествоМесяцевНаВыплату(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат);
				//КоличествоВыплат = Цел(КоличествоВыплатСОстатком) + ?(КоличествоВыплатСОстатком = Цел(КоличествоВыплатСОстатком),0,1);
				//Если Не БылоИзменениеКоличестваВыплатВЭтомПериоде(КоличествоВыплат,ТекСтрокаСписокСчетов.НомерСчета,Ссылка,Дата) Тогда
				//	Движение = Движения.уп_КоличествоНазначенныхВыплат.Добавить();
				//	Движение.Период = Дата;
				//	Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				//	КоличествоВыплатСОстатком = ТекСтрокаСписокСчетов.хм_Каспер_СрокВыплаты/ОпределитьКоличествоМесяцевНаВыплату(ТекСтрокаСписокСчетов.хм_Каспер_ПериодичностьВыплат);
				//	Движение.КоличествоВыплат = КоличествоВыплат;
				//КонецЕсли;
			
				Если хм_УстановитьСрезСчетчикаНачисленийНПО Тогда
					Движение = Движения.хм_СрезСчетчикНачисленийНПО.Добавить();
					Движение.Период = Дата;
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					Движение.ДатаУстановкиСостояния = ДатаИзменения;
				КонецЕсли;
				
			ИначеЕсли ТекСтрокаСписокСчетов.хм_Каспер_ПродолжительностьВыплатыПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				Движение = Движения.уп_СрокиПеререгистрации.Добавить();
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Период = Дата;
				Движение.ДатаСледующейПеререгистрации = ТекСтрокаСписокСчетов.хм_Каспер_ДатаОкончанияДействия;
 			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Движения.уп_СостоянияПС.Записать();
	Движения.уп_ЛицевыеСчетаУчастников.Записать();
	Движения.хм_СрезСчетчикНачисленийНПО.Записать();
	Движения.уп_ПериодичностьВыплат.Записать();
//ЛыткинАМ //https://redmine.npf.com/issues/4288
//	Движения.уп_КоличествоНазначенныхВыплат.Записать();
    Движения.уп_ДатыСледующихВыплат.Записать();
    Движения.уп_ДатыОкончанияСрочнойВыплаты.Записать();
    Движения.уп_СрокиПеререгистрации.Записать();

КонецПроцедуры
